app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Rodrigo"], ["email", "fgrg@hola.cl"], ["created_at", "2018-06-20 20:39:25.009951"], ["updated_at", "2018-06-20 20:39:25.009951"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save