app/controllers/orders_controller.rb

INSERT INTO "orders" ("name", "created_at", "updated_at", "customer_id", "pizza_id") VALUES (?, ?, ?, ?, ?)  [["name", "holaf"], ["created_at", "2018-06-20 21:51:20.785224"], ["updated_at", "2018-06-20 21:51:20.785224"], ["customer_id", 1], ["pizza_id", 1]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save