app/controllers/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
  def index
    @pizzas = Pizza.all

INSERT INTO "pizzas" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pepperoni"], ["price", 5000], ["created_at", "2018-06-20 19:30:51.881189"], ["updated_at", "2018-06-20 19:30:51.881189"]]
---
  def create
    @pizza = Pizza.new(pizza_params)

    respond_to do |format|
      if @pizza.save

UPDATE "pizzas" SET "name" = ?, "updated_at" = ? WHERE "pizzas"."id" = ?  [["name", "Super Pepperoni"], ["updated_at", "2018-06-20 21:25:04.457968"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @pizza.update(pizza_params)

DELETE FROM "pizzas" WHERE "pizzas"."id" = ?  [["id", 2]]
---
  def destroy
    @pizza.destroy

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_pizza
      @pizza = Pizza.find(params[:id])