app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("price", "created_at", "updated_at") VALUES (?, ?, ?)  [["price", 6000], ["created_at", "2018-06-20 20:13:35.142652"], ["updated_at", "2018-06-20 20:13:35.142652"]]